Public Member Functions | List of all members
API_PropertyConversionUtilsInterface Class Referenceabstract
Property Manager
#include <APIdefs_Properties.h>
 Public Member Functions
 virtual const GS::UniString &  | GetDegreeSymbol1 () const =0
 virtual const GS::UniString &  | GetDegreeSymbol2 () const =0
 virtual const GS::UniString &  | GetMinuteSymbol () const =0
 virtual const GS::UniString &  | GetSecondSymbol () const =0
 virtual const GS::UniString &  | GetGradientSymbol () const =0
 virtual const GS::UniString &  | GetRadianSymbol () const =0
 virtual const GS::UniString &  | GetNorthSymbol () const =0
 virtual const GS::UniString &  | GetSouthSymbol () const =0
 virtual const GS::UniString &  | GetEastSymbol () const =0
 virtual const GS::UniString &  | GetWestSymbol () const =0
 virtual GS::uchar_t  | GetDecimalDelimiterChar () const =0
 virtual GS::Optional< GS::UniChar >  | GetThousandSeparatorChar () const =0
 virtual API_LengthTypeID  | GetLengthType () const =0
 virtual API_AreaTypeID  | GetAreaType () const =0
 virtual API_VolumeTypeID  | GetVolumeType () const =0
 virtual API_AngleTypeID  | GetAngleType () const =0
Detailed Description
An interface for getting units of measurement for string to property value conversion. The class which implements the interface has to return the appropriate units of measurement and delimiters. It is only used for ACAPI_Property_SetPropertyValueFromString.
Since
Archicad 25
Remarks
Interface class for passing in the desired units of measurement to ACAPI_Property_SetPropertyValueFromString. For a detailed example see the Property_Test test add-on.